-- Creamos el Esquema

create schema Flota_keepcoding;

-- Crear la tabla Grupo
CREATE table flota_keepcoding.grupo (
	id_grupo serial4 NOT NULL,
	nombre_grupo varchar(50) NOT NULL,
	CONSTRAINT grupo_pkey PRIMARY KEY (id_grupo)
);
CREATE TABLE flota_keepcoding.marca (
	id_marca serial4 NOT NULL,
	nombre_marca varchar(50) NOT NULL,
	id_grupo int4 NULL,
	marca varchar(50) NULL,
	grupo varchar(50) NULL,
	CONSTRAINT marca_pkey PRIMARY KEY (id_marca)
);


-- -- flota_kc.marca foreign keys

ALTER table flota_keepcoding.marca ADD CONSTRAINT marca_id_grupo_fkey FOREIGN KEY (id_grupo) REFERENCES flota_keepcoding.grupo(id_grupo);

-- flota_kc.aseguradora definition

-- Drop table

-- DROP TABLE flota_kc.aseguradora;

CREATE TABLE flota_keepcoding.aseguradora (
	id_aseguradora serial4 NOT NULL,
	nombre_aseguradora varchar(50) NOT NULL,
	CONSTRAINT aseguradora_pkey PRIMARY KEY (id_aseguradora)
);


-- flota_keepcoding.coche definition


CREATE TABLE flota_keepcoding.coche (
	id_coche serial4 NOT NULL,
	modelo varchar(25) NOT NULL,
	id_marca int4 NULL,
	color varchar(15) NULL,
	matricula varchar(15) NULL,
	kilometros int4 NULL,
	id_aseguradora int4 NULL,
	numero_poliza varchar(25) NULL,
	fecha_compra date NOT NULL,
	fecha_alta_seguro date NOT NULL,
	CONSTRAINT coche_pkey PRIMARY KEY (id_coche)
);


-- flota_keepcoding.revision definition


CREATE TABLE flota_keepcoding.revision (
	id_revision serial4 NOT NULL,
	id_coche int4 NULL,
	kilometros_revision int4 NULL,
	fecha_revision date NULL,
	importe float8 NULL,
	moneda varchar(10) NULL,
	CONSTRAINT revision_pkey PRIMARY KEY (id_revision)
);


-- flota_kc.revision foreign keys

ALTER TABLE flota_keepcoding.revision ADD CONSTRAINT revision_id_coche_fkey FOREIGN KEY (id_coche) REFERENCES flota_keepcoding.coche(id_coche);

-- flota_keepcoding.coche foreign keys

ALTER TABLE flota_keepcoding.coche ADD CONSTRAINT coche_id_aseguradora_fkey FOREIGN KEY (id_aseguradora) REFERENCES flota_keepcoding.aseguradora(id_aseguradora);
ALTER TABLE flota_keepcoding.coche ADD CONSTRAINT coche_id_marca_fkey FOREIGN KEY (id_marca) REFERENCES flota_keepcoding.marca(id_marca);

INSERT INTO flota_keepcoding.aseguradora (nombre_aseguradora) VALUES
	 ('Mapfre'),
	 ('Axa'),
	 ('Allianz'),
	 ('Generali');

	
	INSERT INTO flota_keepcoding.grupo (nombre_grupo) VALUES
	 ('Renault-Nissan-Mitsubishi Alliance'),
	 ('Hyundai Motor Group'),
	 ('PSA Peugeot S.A.');

	INSERT INTO flota_keepcoding.marca (nombre_marca,id_grupo,marca,grupo) VALUES
	 ('Citroën',3,NULL,NULL),
	 ('Peugeot',3,NULL,NULL),
	 ('Dacia',1,NULL,NULL),
	 ('Nissan',1,NULL,NULL),
	 ('Hyundai',2,NULL,NULL),
	 ('Kia',2,NULL,NULL),
	 ('Renault',1,NULL,NULL);

	INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Rio',6,'Gris Plateado','6743DYG',76387,1,'116398','2007-06-25','2008-09-16'),
	 ('Tucson',5,'Verde','7764GTD',54522,3,'136882','2012-10-01','2014-01-28'),
	 ('Megane',7,'Gris Plateado','0827DBB',39061,4,'40647','2006-07-24','2006-07-24'),
	 ('i30',5,'Blanco','6788DRX',36066,2,'7094','2007-11-15','2007-11-15'),
	 ('Rio',6,'Azul','4221JXR',50166,4,'174298','2018-03-19','2018-03-19'),
	 ('206',2,'Blanco','7136BCS',43363,4,'6062','2001-02-09','2001-02-09'),
	 ('Berlingo',1,'Gris Plateado','2066BYF',57697,4,'126373','1999-03-14','2000-01-12'),
	 ('i30',5,'Verde','5022JZD',63426,1,'173686','2016-03-07','2016-03-07'),
	 ('Clio',7,'Gris Plateado','7466DMG',85722,3,'145462','2007-03-31','2007-03-31'),
	 ('i30',5,'Gris Plateado','9775BVC',29962,4,'64092','2001-03-14','2001-03-14');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('5008',2,'Negro','0922JVF',97321,1,'182094','2017-07-06','2019-01-02'),
	 ('DS4',1,'Blanco','5047FJK',90641,1,'161701','2009-10-26','2010-10-16'),
	 ('Berlingo',1,'Negro','2430FDP',91570,4,'118284','2008-06-23','2008-06-23'),
	 ('Qashqai',4,'Negro','8718CJT',46682,3,'20640','2005-08-23','2005-08-23'),
	 ('Clio',7,'Gris Plateado','8177JPM',77082,3,'119373','2016-11-27','2016-11-27'),
	 ('Ceed',6,'Blanco','7221BJG',70197,1,'135515','1999-09-30','2001-04-05'),
	 ('DS4',1,'Rojo','1621CSY',42218,1,'89394','2004-10-12','2004-10-12'),
	 ('DS4',1,'Blanco','4325KMF',49476,1,'12534','2020-04-13','2020-04-13'),
	 ('DS4',1,'Gris Plateado','2438GSV',52349,3,'195443','2010-04-17','2010-04-17'),
	 ('Berlingo',1,'Gris Plateado','2066BYF',57697,2,'105112','1999-03-14','1999-03-14');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('i30',5,'Verde','5022JZD',63426,2,'191842','2016-03-07','2017-08-09'),
	 ('Qashqai',4,'Negro','4896HCC',45887,4,'8576','2014-05-19','2014-05-19'),
	 ('206',2,'Verde','7710HMZ',45773,3,'190446','2014-04-09','2015-09-03'),
	 ('Ceed',6,'Verde','5648JTZ',61124,2,'117439','2016-04-14','2017-11-21'),
	 ('Ceed',6,'Gris Plateado','5205DFJ',50972,3,'41930','2006-03-04','2006-03-04'),
	 ('Qashqai',4,'Verde','9024CVP',25161,3,'62061','2004-01-15','2004-01-15'),
	 ('Qashqai',4,'Azul','4916HJG',64638,2,'136600','2015-03-29','2015-03-29'),
	 ('DS4',1,'Negro','2684FZV',36859,1,'50387','2008-05-10','2008-05-10'),
	 ('Tucson',5,'Azul','5865JKB',30495,2,'86600','2016-01-24','2016-01-24'),
	 ('Kangoo',7,'Negro','1323DQL',107492,1,'172309','2006-01-22','2006-01-22');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Qashqai',4,'Negro','3274CYM',31210,2,'39780','2004-03-13','2004-03-13'),
	 ('5008',2,'Gris Plateado','0326HRM',105374,4,'187973','2014-06-28','2015-06-19'),
	 ('DS4',1,'Rojo','3313GGW',35823,1,'85225','2013-04-01','2013-04-01'),
	 ('5008',2,'Negro','7224FDF',28796,1,'48113','2008-04-29','2008-04-29'),
	 ('Duster',3,'Blanco','8802GQX',34941,4,'167291','2013-04-23','2014-05-02'),
	 ('i30',5,'Azul','5188DWK',74494,4,'157749','2007-12-07','2009-03-12'),
	 ('Leaf',4,'Verde','3306GYM',76024,2,'173030','2011-12-19','2013-02-18'),
	 ('Tucson',5,'Verde','8706FTV',53733,1,'91503','2008-05-16','2008-05-16'),
	 ('DS4',1,'Rojo','8217BCW',43385,1,'194490','2001-12-18','2003-07-13'),
	 ('DS4',1,'Gris Plateado','2438GSV',52349,2,'110761','2010-04-17','2011-08-23');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('DS4',1,'Negro','7631GCM',31372,3,'63946','2011-09-17','2011-09-17'),
	 ('Leaf',4,'Azul','7295DHG',34938,1,'55403','2006-10-17','2006-10-17'),
	 ('Leaf',4,'Rojo','1970BLH',47354,4,'102441','2002-04-18','2003-03-27'),
	 ('i30',5,'Rojo','3187KKM',69946,4,'196487','2019-01-14','2019-01-14'),
	 ('Kangoo',7,'Rojo','7489HBJ',37783,2,'82585','2014-10-11','2014-10-11'),
	 ('Rio',6,'Verde','0007HHR',37686,3,'131987','2014-03-30','2015-10-03'),
	 ('DS4',1,'Blanco','5047FJK',90641,1,'172625','2009-10-26','2009-10-26'),
	 ('Megane',7,'Verde','9729KXJ',76972,4,'131978','2020-09-06','2021-12-21'),
	 ('Qashqai',4,'Azul','4916HJG',64638,3,'163789','2015-03-29','2016-01-31'),
	 ('i30',5,'Blanco','7561CND',71901,1,'170914','2004-09-22','2004-09-22');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Duster',3,'Blanco','3122DZN',50250,2,'113718','2007-12-01','2008-11-19'),
	 ('5008',2,'Azul','6640FPQ',38454,2,'85627','2008-02-12','2008-02-12'),
	 ('Kangoo',7,'Rojo','2835JQN',61510,3,'144448','2016-11-16','2016-11-16'),
	 ('Tucson',5,'Gris Plateado','7938HXH',53342,1,'163498','2015-10-24','2015-10-24'),
	 ('Clio',7,'Blanco','3883DSH',35949,1,'54632','2007-02-27','2007-02-27'),
	 ('Rio',6,'Verde','3272JJJ',27503,1,'89739','2018-06-03','2018-06-03'),
	 ('Tucson',5,'Gris Plateado','8540DXG',27722,2,'71232','2007-03-13','2007-03-13'),
	 ('Megane',7,'Verde','2428HYB',87006,2,'161471','2014-12-04','2015-10-15'),
	 ('Qashqai',4,'Negro','5954DWX',39775,3,'121919','2007-10-25','2008-08-21'),
	 ('Ceed',6,'Negro','6010JXB',46520,1,'117329','2017-06-30','2018-06-05');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('i30',5,'Blanco','7561CND',71901,1,'172754','2004-09-22','2006-03-23'),
	 ('5008',2,'Rojo','0393DWY',41340,3,'73097','2007-08-02','2007-08-02'),
	 ('5008',2,'Gris Plateado','0366CKQ',118687,3,'111429','2003-04-10','2004-05-29'),
	 ('DS4',1,'Gris Plateado','5303DCG',35530,3,'79203','2007-08-30','2007-08-30'),
	 ('Qashqai',4,'Negro','3230KTX',69200,2,'127909','2019-04-16','2020-09-18'),
	 ('Duster',3,'Verde','6335BFK',53657,2,'190383','1999-06-06','1999-06-06'),
	 ('Leaf',4,'Blanco','9666FZC',39533,3,'79841','2008-03-03','2008-03-03'),
	 ('Duster',3,'Rojo','6231KKQ',39563,3,'34218','2019-04-10','2019-04-10'),
	 ('Ceed',6,'Verde','9428BCQ',33451,3,'96367','2002-11-12','2002-11-12'),
	 ('Lodgy',3,'Gris Plateado','6016FWX',27713,1,'54681','2008-04-29','2008-04-29');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('DS4',1,'Negro','9412DTS',54013,4,'82043','2007-01-31','2007-01-31'),
	 ('Tucson',5,'Blanco','8627FRY',30083,1,'51353','2008-04-02','2008-04-02'),
	 ('Ceed',6,'Negro','5426HDG',46759,2,'144573','2015-04-01','2015-04-01'),
	 ('Megane',7,'Rojo','3242GQG',77662,4,'187526','2013-03-06','2014-07-14'),
	 ('Ceed',6,'Gris Plateado','1567JPK',54278,4,'19347','2016-12-03','2016-12-03'),
	 ('i30',5,'Azul','5188DWK',74494,2,'161477','2007-12-07','2007-12-07'),
	 ('Ceed',6,'Gris Plateado','2890DSR',28530,3,'16848','2006-07-13','2006-07-13'),
	 ('Tucson',5,'Verde','7764GTD',54522,4,'125045','2012-10-01','2012-10-01'),
	 ('i30',5,'Azul','2874BRD',46794,1,'115392','2000-10-01','2002-01-17'),
	 ('Ceed',6,'Rojo','5751FCL',40662,3,'4341','2008-07-30','2008-07-30');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Kangoo',7,'Negro','3960JYB',30810,1,'8307','2017-09-15','2017-09-15'),
	 ('Kangoo',7,'Rojo','6708BTB',44027,4,'124038','2001-07-17','2002-12-12'),
	 ('Berlingo',1,'Blanco','9157JVM',41539,3,'96770','2017-09-18','2017-09-18'),
	 ('Berlingo',1,'Negro','2430FDP',91570,4,'137325','2008-06-23','2009-10-14'),
	 ('Tucson',5,'Verde','7792CKF',59984,3,'139949','2003-03-02','2003-03-02'),
	 ('Rio',6,'Blanco','7987FXL',24726,4,'32844','2009-01-23','2009-01-23'),
	 ('Megane',7,'Rojo','3242GQG',77662,1,'183813','2013-03-06','2013-03-06'),
	 ('i30',5,'Azul','6532KNR',35831,4,'45918','2019-03-24','2019-03-24'),
	 ('i30',5,'Azul','7905HMT',38622,2,'56264','2015-10-31','2015-10-31'),
	 ('i30',5,'Negro','2907GNT',51508,1,'92532','2012-11-08','2012-11-08');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('DS4',1,'Verde','0390DRK',38651,2,'121129','2007-03-27','2008-05-01'),
	 ('5008',2,'Negro','0922JVF',97321,1,'104210','2017-07-06','2017-07-06'),
	 ('Tucson',5,'Verde','7792CKF',59984,1,'126578','2003-03-02','2004-01-30'),
	 ('Ceed',6,'Blanco','6850KZW',25227,1,'66942','2020-05-11','2020-05-11'),
	 ('Duster',2,'Verde','6335BFK',53657,3,'177717','1999-06-06','2000-05-01'),
	 ('i30',5,'Gris Plateado','5851CSB',39717,4,'73547','2004-06-21','2004-06-21'),
	 ('Qashqai',4,'Negro','7457BFT',39949,1,'35103','2000-11-24','2000-11-24'),
	 ('Tucson',5,'Gris Plateado','9281BNK',35517,1,'88106','2002-04-06','2002-04-06'),
	 ('Qashqai',4,'Negro','3230KTX',69200,4,'146739','2019-04-16','2019-04-16'),
	 ('Qashqai',4,'Negro','9314JHS',41064,3,'67577','2017-10-10','2017-10-10');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Ceed',6,'Blanco','7221BJG',70197,3,'112320','1999-09-30','1999-09-30'),
	 ('Leaf',4,'Verde','3306GYM',76024,4,'174969','2011-12-19','2011-12-19'),
	 ('Duster',3,'Blanco','8926GPQ',42989,3,'26976','2012-09-29','2012-09-29'),
	 ('Kangoo',7,'Rojo','2835JQN',61510,3,'108872','2016-11-16','2018-05-12'),
	 ('206',2,'Negro','6756GXW',112881,1,'142266','2011-07-19','2011-07-19'),
	 ('Kangoo',7,'Negro','1323DQL',107492,4,'176268','2006-01-22','2007-01-07'),
	 ('Leaf',4,'Azul','8563JCM',45745,1,'84213','2017-10-11','2017-10-11'),
	 ('Clio',7,'Gris Plateado','7466DMG',85722,3,'190418','2007-03-31','2008-05-10'),
	 ('Rio',6,'Azul','4221JXR',50166,4,'109846','2018-03-19','2019-03-11'),
	 ('Tucson',5,'Verde','5899CLW',35922,3,'187586','2003-03-02','2004-05-18');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('i30',5,'Rojo','3187KKM',69946,3,'189761','2019-01-14','2020-08-03'),
	 ('5008',2,'Rojo','9209KGR',58260,4,'174043','2020-03-02','2020-03-02'),
	 ('Tucson',5,'Gris Plateado','7938HXH',53342,2,'105002','2015-10-24','2016-10-04'),
	 ('Megane',7,'Verde','9729KXJ',76972,3,'184039','2020-09-06','2020-09-06'),
	 ('Megane',7,'Verde','2428HYB',87006,4,'181054','2014-12-04','2014-12-04'),
	 ('206',2,'Negro','6756GXW',112881,4,'159753','2011-07-19','2012-10-22'),
	 ('Ceed',6,'Negro','5426HDG',46759,4,'186297','2015-04-01','2016-08-24'),
	 ('Tucson',5,'Verde','4366GZX',44510,2,'40977','2013-11-03','2013-11-03'),
	 ('Tucson',5,'Verde','6642GZP',97183,1,'151249','2010-04-21','2010-04-21'),
	 ('5008',2,'Gris Plateado','0366CKQ',118687,2,'172546','2003-04-10','2003-04-10');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Duster',3,'Gris Plateado','4315JKL',46145,1,'9482','2017-08-27','2017-08-27'),
	 ('5008',2,'Rojo','9209KGR',58260,2,'118686','2020-03-02','2021-09-02'),
	 ('5008',2,'Gris Plateado','0326HRM',105374,2,'179156','2014-06-28','2014-06-28'),
	 ('206',2,'Rojo','4389KSN',30862,2,'112290','2019-02-14','2020-09-21'),
	 ('206',2,'Rojo','2633GJF',41129,1,'124027','2011-02-19','2012-04-19'),
	 ('Clio',7,'Rojo','7343FRT',47644,3,'25786','2009-06-01','2009-06-01'),
	 ('Rio',6,'Blanco','5572DHP',42143,2,'75790','2007-06-06','2007-06-06'),
	 ('Tucson',5,'Rojo','4761CVL',35224,3,'94565','2003-04-08','2003-04-08'),
	 ('Rio',6,'Gris Plateado','6743DYG',76387,2,'116336','2007-06-25','2007-06-25'),
	 ('Clio',7,'Gris Plateado','8177JPM',77082,1,'192389','2016-11-27','2018-04-19');
INSERT INTO flota_keepcoding.coche (modelo,id_marca,color,matricula,kilometros,id_aseguradora,numero_poliza,fecha_compra,fecha_alta_seguro) VALUES
	 ('Ceed',6,'Verde','5648JTZ',61124,3,'189152','2016-04-14','2016-04-14'),
	 ('Rio',6,'Gris Plateado','3212HJW',28986,2,'117277','2014-08-04','2015-12-19'),
	 ('Tucson',5,'Verde','6642GZP',97183,2,'169829','2010-04-21','2011-12-01');

	INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (40,12028,'2010-05-13',734.7000122070312,'Dólar'),
	 (19,12028,'2010-05-13',734.7000122070312,'Dólar'),
	 (40,28312,'2016-05-17',460.0,'Euro'),
	 (19,28312,'2016-05-17',460.0,'Euro'),
	 (101,41764,'2008-05-24',800.0,'Euro'),
	 (16,41764,'2008-05-24',800.0,'Euro'),
	 (116,50738,'2012-04-02',697.5,'Dólar'),
	 (105,50738,'2012-04-02',697.5,'Dólar'),
	 (86,11140,'2021-12-04',730.0,'Euro'),
	 (55,19245,'2014-05-16',570.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (87,16209,'2014-02-10',120.9000015258789,'Dólar'),
	 (74,16209,'2014-02-10',120.9000015258789,'Dólar'),
	 (87,27845,'2014-04-27',80.0,'Euro'),
	 (74,27845,'2014-04-27',80.0,'Euro'),
	 (117,16879,'2015-09-27',437.1000061035156,'Dólar'),
	 (73,16879,'2015-09-27',437.1000061035156,'Dólar'),
	 (68,13755,'2021-04-04',632.4000244140625,'Dólar'),
	 (97,16226,'2018-09-24',90.0,'Euro'),
	 (132,14526,'2023-04-14',170.0,'Euro'),
	 (133,49405,'2011-05-04',83.69999694824219,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (119,49405,'2011-05-04',83.69999694824219,'Dólar'),
	 (3,24407,'2019-02-23',325.5,'Dólar'),
	 (47,40390,'2010-05-03',399.8999938964844,'Dólar'),
	 (12,40390,'2010-05-03',399.8999938964844,'Dólar'),
	 (118,21132,'2017-08-27',306.8999938964844,'Dólar'),
	 (61,42110,'2021-04-19',74.4000015258789,'Dólar'),
	 (50,42110,'2021-04-19',74.4000015258789,'Dólar'),
	 (59,25110,'2016-05-30',440.0,'Euro'),
	 (83,21421,'2020-12-29',390.6000061035156,'Dólar'),
	 (120,51615,'2003-07-26',590.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (63,51615,'2003-07-26',590.0,'Euro'),
	 (120,74997,'2004-04-27',83.69999694824219,'Dólar'),
	 (63,74997,'2004-04-27',83.69999694824219,'Dólar'),
	 (120,90943,'2009-06-04',548.7000122070312,'Dólar'),
	 (63,90943,'2009-06-04',548.7000122070312,'Dólar'),
	 (90,25366,'2016-03-09',753.2999877929688,'Dólar'),
	 (115,17526,'2014-12-09',269.70001220703125,'Dólar'),
	 (58,17526,'2014-12-09',269.70001220703125,'Dólar'),
	 (115,40875,'2015-09-05',610.0,'Euro'),
	 (58,40875,'2015-09-05',610.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (115,59896,'2015-09-23',290.0,'Euro'),
	 (58,59896,'2015-09-23',290.0,'Euro'),
	 (115,72001,'2016-05-24',399.8999938964844,'Dólar'),
	 (58,72001,'2016-05-24',399.8999938964844,'Dólar'),
	 (129,60377,'2012-11-14',450.0,'Euro'),
	 (1,60377,'2012-11-14',450.0,'Euro'),
	 (35,22523,'2015-06-15',820.0,'Euro'),
	 (101,12066,'2000-05-18',1162115.125,'Peso '),
	 (16,12066,'2000-05-18',1162115.125,'Peso '),
	 (116,21955,'2012-01-19',3615469.25,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (105,21955,'2012-01-19',3615469.25,'Peso '),
	 (116,74499,'2012-06-28',11869.2001953125,'Peso '),
	 (105,74499,'2012-06-28',11869.2001953125,'Peso '),
	 (116,94670,'2013-06-24',3579.60009765625,'Peso '),
	 (105,94670,'2013-06-24',3579.60009765625,'Peso '),
	 (100,24441,'2019-09-04',14695.2001953125,'Peso '),
	 (18,20410,'2022-07-08',7912.7998046875,'Peso '),
	 (87,38072,'2014-06-07',1695.5999755859375,'Peso '),
	 (74,38072,'2014-06-07',1695.5999755859375,'Peso '),
	 (87,49153,'2021-11-30',16767.599609375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (74,49153,'2021-11-30',16767.599609375,'Peso '),
	 (121,20263,'2017-11-02',15825.599609375,'Peso '),
	 (117,34964,'2019-08-24',2883767.0,'Peso '),
	 (73,34964,'2019-08-24',2883767.0,'Peso '),
	 (25,23043,'2022-05-24',14883.599609375,'Peso '),
	 (33,17187,'2017-12-13',1884.0,'Peso '),
	 (133,21563,'2011-01-06',3228097.5,'Peso '),
	 (119,21563,'2011-01-06',3228097.5,'Peso '),
	 (133,69454,'2023-03-11',1507.199951171875,'Peso '),
	 (119,69454,'2023-03-11',1507.199951171875,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (102,18060,'2012-04-17',1463404.25,'Peso '),
	 (37,18060,'2012-04-17',1463404.25,'Peso '),
	 (102,37513,'2013-01-10',16767.599609375,'Peso '),
	 (37,37513,'2013-01-10',16767.599609375,'Peso '),
	 (102,58378,'2019-06-16',14883.599609375,'Peso '),
	 (37,58378,'2019-06-16',14883.599609375,'Peso '),
	 (64,14181,'2022-05-31',11492.400390625,'Peso '),
	 (47,18053,'2010-02-22',5086.7998046875,'Peso '),
	 (12,18053,'2010-02-22',5086.7998046875,'Peso '),
	 (47,63099,'2010-12-08',2324230.25,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (12,63099,'2010-12-08',2324230.25,'Peso '),
	 (61,13171,'2006-01-18',12622.7998046875,'Peso '),
	 (50,13171,'2006-01-18',12622.7998046875,'Peso '),
	 (61,29474,'2006-02-27',2926808.5,'Peso '),
	 (50,29474,'2006-02-27',2926808.5,'Peso '),
	 (120,24801,'2003-04-28',13941.599609375,'Peso '),
	 (63,24801,'2003-04-28',13941.599609375,'Peso '),
	 (129,22761,'2008-01-13',8101.2001953125,'Peso '),
	 (1,22761,'2008-01-13',8101.2001953125,'Peso '),
	 (129,34009,'2008-03-17',9608.400390625,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (1,34009,'2008-03-17',9608.400390625,'Peso '),
	 (38,25843,'2011-12-07',3658510.5,'Peso '),
	 (75,28259,'2017-05-12',301289.09375,'Peso '),
	 (92,25300,'2018-11-25',602578.1875,'Peso '),
	 (11,25300,'2018-11-25',602578.1875,'Peso '),
	 (92,49167,'2018-12-06',6594.0,'Peso '),
	 (11,49167,'2018-12-06',6594.0,'Peso '),
	 (21,35020,'2021-04-19',539.4000244140625,'Dólar'),
	 (8,35020,'2021-04-19',539.4000244140625,'Dólar'),
	 (130,41924,'2017-11-25',483.6000061035156,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (15,41924,'2017-11-25',483.6000061035156,'Dólar'),
	 (72,16181,'2020-04-28',120.9000015258789,'Dólar'),
	 (113,20157,'2016-09-08',186.0,'Dólar'),
	 (54,20157,'2016-09-08',186.0,'Dólar'),
	 (113,34833,'2017-10-23',590.0,'Euro'),
	 (54,34833,'2017-10-23',590.0,'Euro'),
	 (99,44068,'2023-02-02',688.2000122070312,'Dólar'),
	 (65,44068,'2023-02-02',688.2000122070312,'Dólar'),
	 (109,18380,'2018-06-08',50.0,'Euro'),
	 (5,18380,'2018-06-08',50.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (109,38809,'2022-05-22',204.60000610351562,'Dólar'),
	 (5,38809,'2022-05-22',204.60000610351562,'Dólar'),
	 (56,11209,'2022-10-04',210.0,'Euro'),
	 (71,24707,'2015-05-30',46.5,'Dólar'),
	 (114,14348,'2020-10-11',110.0,'Euro'),
	 (48,14348,'2020-10-11',110.0,'Euro'),
	 (114,36512,'2021-09-13',632.4000244140625,'Dólar'),
	 (48,36512,'2021-09-13',632.4000244140625,'Dólar'),
	 (77,13864,'2014-07-23',213.89999389648438,'Dólar'),
	 (108,19536,'2007-06-16',200.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (9,19536,'2007-06-16',200.0,'Euro'),
	 (108,39863,'2007-09-26',325.5,'Dólar'),
	 (9,39863,'2007-09-26',325.5,'Dólar'),
	 (108,56109,'2018-10-08',270.0,'Euro'),
	 (9,56109,'2018-10-08',270.0,'Euro'),
	 (81,17211,'2018-08-22',158.10000610351562,'Dólar'),
	 (122,31259,'2023-08-16',210.0,'Euro'),
	 (112,31259,'2023-08-16',210.0,'Euro'),
	 (106,49644,'2006-12-02',590.0,'Euro'),
	 (30,49644,'2006-12-02',590.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (28,17713,'2008-06-07',455.70001220703125,'Dólar'),
	 (62,22765,'2020-02-03',50.0,'Euro'),
	 (93,16746,'2003-05-06',560.0,'Euro'),
	 (85,16746,'2003-05-06',560.0,'Euro'),
	 (89,11937,'2020-07-14',590.0,'Euro'),
	 (80,16314,'2010-08-06',446.3999938964844,'Dólar'),
	 (42,20272,'2009-06-01',850.0,'Euro'),
	 (79,27678,'2021-12-22',232.5,'Dólar'),
	 (14,25928,'2005-09-11',460.0,'Euro'),
	 (107,17322,'2018-05-24',720.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (52,14565,'2022-10-14',350.0,'Euro'),
	 (4,15306,'2015-12-29',840.0,'Euro'),
	 (84,29114,'2009-07-10',530.0,'Euro'),
	 (13,29114,'2009-07-10',530.0,'Euro'),
	 (84,66643,'2011-11-06',770.0,'Euro'),
	 (13,66643,'2011-11-06',770.0,'Euro'),
	 (96,20756,'2011-03-09',780.0,'Euro'),
	 (21,11715,'2016-05-13',430413.0,'Peso '),
	 (8,11715,'2016-05-13',430413.0,'Peso '),
	 (130,19822,'2017-01-24',1678610.75,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (15,19822,'2017-01-24',1678610.75,'Peso '),
	 (130,57202,'2021-05-04',387371.6875,'Peso '),
	 (15,57202,'2021-05-04',387371.6875,'Peso '),
	 (99,25879,'2019-05-13',4898.39990234375,'Peso '),
	 (65,25879,'2019-05-13',4898.39990234375,'Peso '),
	 (23,22300,'2022-08-28',3391.199951171875,'Peso '),
	 (125,25614,'2023-07-13',3055932.25,'Peso '),
	 (131,22988,'2017-11-12',16390.80078125,''),
	 (24,22988,'2017-11-12',16390.80078125,''),
	 (131,47336,'2019-06-20',946908.625,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (24,47336,'2019-06-20',946908.625,'Peso '),
	 (17,29407,'2022-08-18',4898.39990234375,'Peso '),
	 (69,14720,'2022-05-03',16956.0,'Peso '),
	 (114,52881,'2022-04-12',3873717.0,'Peso '),
	 (48,52881,'2022-04-12',3873717.0,'Peso '),
	 (20,14097,'1999-09-04',1162115.125,'Peso '),
	 (7,14097,'1999-09-04',1162115.125,'Peso '),
	 (20,28378,'2014-05-14',559536.875,'Peso '),
	 (7,28378,'2014-05-14',559536.875,'Peso '),
	 (122,12808,'2021-08-15',2637.60009765625,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (112,12808,'2021-08-15',2637.60009765625,'Peso '),
	 (106,26924,'2006-02-11',3012891.0,'Peso '),
	 (30,26924,'2006-02-11',3012891.0,'Peso '),
	 (106,62371,'2007-01-03',3701551.75,'Peso '),
	 (30,62371,'2007-01-03',3701551.75,'Peso '),
	 (106,90278,'2007-11-23',3572428.0,'Peso '),
	 (30,90278,'2007-11-23',3572428.0,'Peso '),
	 (60,19345,'2018-07-09',8854.7998046875,'Peso '),
	 (98,15082,'2003-10-06',9043.2001953125,'Peso '),
	 (93,37787,'2009-05-25',3830675.75,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (85,37787,'2009-05-25',3830675.75,'Peso '),
	 (10,11436,'2001-04-27',1936858.5,'Peso '),
	 (51,27367,'2022-05-06',16202.400390625,'Peso '),
	 (84,53723,'2009-08-21',3228097.5,'Peso '),
	 (13,53723,'2009-08-21',3228097.5,'Peso '),
	 (82,27720,'2007-01-18',7347.60009765625,'Peso '),
	 (49,17802,'2015-12-22',100.0,'Euro'),
	 (27,17802,'2015-12-22',100.0,'Euro'),
	 (49,39243,'2023-08-26',46.5,'Dólar'),
	 (27,39243,'2023-08-26',46.5,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (57,15249,'2014-01-12',530.0999755859375,'Dólar'),
	 (95,34682,'2009-04-14',279.0,'Dólar'),
	 (66,34682,'2009-04-14',279.0,'Dólar'),
	 (41,15837,'2021-11-16',830.0,'Euro'),
	 (45,22207,'2019-08-02',316.20001220703125,'Dólar'),
	 (76,37800,'2008-09-25',670.0,'Euro'),
	 (36,37800,'2008-09-25',670.0,'Euro'),
	 (78,16201,'2013-10-25',510.0,'Euro'),
	 (2,16201,'2013-10-25',510.0,'Euro'),
	 (6,22625,'2003-10-29',595.2000122070312,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (104,45588,'2021-08-01',669.5999755859375,'Dólar'),
	 (53,45588,'2021-08-01',669.5999755859375,'Dólar'),
	 (29,11276,'2016-07-17',620.0,'Euro'),
	 (103,25569,'2016-11-01',330.0,'Euro'),
	 (39,25009,'2020-05-08',620.0,'Euro'),
	 (123,20625,'2015-05-30',827.7000122070312,'Dólar'),
	 (32,20625,'2015-05-30',827.7000122070312,'Dólar'),
	 (123,46451,'2015-06-11',548.7000122070312,'Dólar'),
	 (32,46451,'2015-06-11',548.7000122070312,'Dólar'),
	 (123,62529,'2015-06-18',350.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (32,62529,'2015-06-18',350.0,'Euro'),
	 (123,90819,'2016-08-25',241.8000030517578,'Dólar'),
	 (32,90819,'2016-08-25',241.8000030517578,'Dólar'),
	 (127,22437,'2014-05-29',186.0,'Dólar'),
	 (126,29564,'2020-07-07',1076032.5,'Peso'),
	 (67,19543,'2017-12-13',344330.40625,'Peso '),
	 (92,76863,'2023-05-08',8478.0,'Peso '),
	 (11,76863,'2023-05-08',8478.0,'Peso '),
	 (91,22339,'2015-12-01',6594.0,'Peso '),
	 (94,15206,'2023-03-05',10173.599609375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (31,17619,'2022-04-15',11869.2001953125,'Peso '),
	 (49,28533,'2015-12-27',516495.59375,'Peso '),
	 (27,28533,'2015-12-27',516495.59375,'Peso '),
	 (110,18724,'2013-09-10',2109023.75,'Peso '),
	 (70,15657,'2014-02-25',817784.6875,'Peso '),
	 (46,23034,'2021-02-22',817784.6875,'Peso '),
	 (95,19109,'1999-09-27',9985.2001953125,'Peso '),
	 (66,19109,'1999-09-27',9985.2001953125,'Peso '),
	 (111,20293,'2019-12-20',602578.1875,'Peso '),
	 (44,20293,'2019-12-20',602578.1875,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (111,33325,'2020-01-25',1979899.75,'Peso '),
	 (44,33325,'2020-01-25',1979899.75,'Peso '),
	 (111,43580,'2021-01-15',14318.400390625,'Peso '),
	 (44,43580,'2021-01-15',14318.400390625,'Peso '),
	 (26,13470,'2014-03-18',2668560.5,'Peso '),
	 (128,21369,'2016-08-16',2109023.75,'Peso '),
	 (76,23426,'2008-06-16',3572428.0,'Peso '),
	 (36,23426,'2008-06-16',3572428.0,'Peso '),
	 (76,60028,'2023-08-20',4898.39990234375,'Peso '),
	 (36,60028,'2023-08-20',4898.39990234375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (78,39865,'2015-03-30',1162115.125,'Peso '),
	 (2,39865,'2015-03-30',1162115.125,'Peso '),
	 (104,18893,'2018-05-05',1695.5999755859375,'Peso '),
	 (53,18893,'2018-05-05',1695.5999755859375,'Peso '),
	 (22,27814,'2020-05-01',7536.0,'Peso '),
	 (34,16890,'2008-11-20',3228097.5,'Peso '),
	 (43,21660,'2010-04-07',2238147.5,'Peso '),
	 (88,19344,'2022-03-26',13753.2001953125,'Peso '),
	 (124,19885,'2021-12-06',559536.875,'Peso '),
	 (40,12028,'2010-05-13',734.7000122070312,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (19,12028,'2010-05-13',734.7000122070312,'Dólar'),
	 (40,28312,'2016-05-17',460.0,'Euro'),
	 (19,28312,'2016-05-17',460.0,'Euro'),
	 (101,41764,'2008-05-24',800.0,'Euro'),
	 (16,41764,'2008-05-24',800.0,'Euro'),
	 (116,50738,'2012-04-02',697.5,'Dólar'),
	 (105,50738,'2012-04-02',697.5,'Dólar'),
	 (86,11140,'2021-12-04',730.0,'Euro'),
	 (55,19245,'2014-05-16',570.0,'Euro'),
	 (87,16209,'2014-02-10',120.9000015258789,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (74,16209,'2014-02-10',120.9000015258789,'Dólar'),
	 (87,27845,'2014-04-27',80.0,'Euro'),
	 (74,27845,'2014-04-27',80.0,'Euro'),
	 (117,16879,'2015-09-27',437.1000061035156,'Dólar'),
	 (73,16879,'2015-09-27',437.1000061035156,'Dólar'),
	 (68,13755,'2021-04-04',632.4000244140625,'Dólar'),
	 (97,16226,'2018-09-24',90.0,'Euro'),
	 (132,14526,'2023-04-14',170.0,'Euro'),
	 (133,49405,'2011-05-04',83.69999694824219,'Dólar'),
	 (119,49405,'2011-05-04',83.69999694824219,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (3,24407,'2019-02-23',325.5,'Dólar'),
	 (47,40390,'2010-05-03',399.8999938964844,'Dólar'),
	 (12,40390,'2010-05-03',399.8999938964844,'Dólar'),
	 (118,21132,'2017-08-27',306.8999938964844,'Dólar'),
	 (61,42110,'2021-04-19',74.4000015258789,'Dólar'),
	 (50,42110,'2021-04-19',74.4000015258789,'Dólar'),
	 (59,25110,'2016-05-30',440.0,'Euro'),
	 (83,21421,'2020-12-29',390.6000061035156,'Dólar'),
	 (120,51615,'2003-07-26',590.0,'Euro'),
	 (63,51615,'2003-07-26',590.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (120,74997,'2004-04-27',83.69999694824219,'Dólar'),
	 (63,74997,'2004-04-27',83.69999694824219,'Dólar'),
	 (120,90943,'2009-06-04',548.7000122070312,'Dólar'),
	 (63,90943,'2009-06-04',548.7000122070312,'Dólar'),
	 (90,25366,'2016-03-09',753.2999877929688,'Dólar'),
	 (115,17526,'2014-12-09',269.70001220703125,'Dólar'),
	 (58,17526,'2014-12-09',269.70001220703125,'Dólar'),
	 (115,40875,'2015-09-05',610.0,'Euro'),
	 (58,40875,'2015-09-05',610.0,'Euro'),
	 (115,59896,'2015-09-23',290.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (58,59896,'2015-09-23',290.0,'Euro'),
	 (115,72001,'2016-05-24',399.8999938964844,'Dólar'),
	 (58,72001,'2016-05-24',399.8999938964844,'Dólar'),
	 (129,60377,'2012-11-14',450.0,'Euro'),
	 (1,60377,'2012-11-14',450.0,'Euro'),
	 (35,22523,'2015-06-15',820.0,'Euro'),
	 (101,12066,'2000-05-18',1162115.125,'Peso '),
	 (16,12066,'2000-05-18',1162115.125,'Peso '),
	 (116,21955,'2012-01-19',3615469.25,'Peso '),
	 (105,21955,'2012-01-19',3615469.25,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (116,74499,'2012-06-28',11869.2001953125,'Peso '),
	 (105,74499,'2012-06-28',11869.2001953125,'Peso '),
	 (116,94670,'2013-06-24',3579.60009765625,'Peso '),
	 (105,94670,'2013-06-24',3579.60009765625,'Peso '),
	 (100,24441,'2019-09-04',14695.2001953125,'Peso '),
	 (18,20410,'2022-07-08',7912.7998046875,'Peso '),
	 (87,38072,'2014-06-07',1695.5999755859375,'Peso '),
	 (74,38072,'2014-06-07',1695.5999755859375,'Peso '),
	 (87,49153,'2021-11-30',16767.599609375,'Peso '),
	 (74,49153,'2021-11-30',16767.599609375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (121,20263,'2017-11-02',15825.599609375,'Peso '),
	 (117,34964,'2019-08-24',2883767.0,'Peso '),
	 (73,34964,'2019-08-24',2883767.0,'Peso '),
	 (25,23043,'2022-05-24',14883.599609375,'Peso '),
	 (33,17187,'2017-12-13',1884.0,'Peso '),
	 (133,21563,'2011-01-06',3228097.5,'Peso '),
	 (119,21563,'2011-01-06',3228097.5,'Peso '),
	 (133,69454,'2023-03-11',1507.199951171875,'Peso '),
	 (119,69454,'2023-03-11',1507.199951171875,'Peso '),
	 (102,18060,'2012-04-17',1463404.25,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (37,18060,'2012-04-17',1463404.25,'Peso '),
	 (102,37513,'2013-01-10',16767.599609375,'Peso '),
	 (37,37513,'2013-01-10',16767.599609375,'Peso '),
	 (102,58378,'2019-06-16',14883.599609375,'Peso '),
	 (37,58378,'2019-06-16',14883.599609375,'Peso '),
	 (64,14181,'2022-05-31',11492.400390625,'Peso '),
	 (47,18053,'2010-02-22',5086.7998046875,'Peso '),
	 (12,18053,'2010-02-22',5086.7998046875,'Peso '),
	 (47,63099,'2010-12-08',2324230.25,'Peso '),
	 (12,63099,'2010-12-08',2324230.25,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (61,13171,'2006-01-18',12622.7998046875,'Peso '),
	 (50,13171,'2006-01-18',12622.7998046875,'Peso '),
	 (61,29474,'2006-02-27',2926808.5,'Peso '),
	 (50,29474,'2006-02-27',2926808.5,'Peso '),
	 (120,24801,'2003-04-28',13941.599609375,'Peso '),
	 (63,24801,'2003-04-28',13941.599609375,'Peso '),
	 (129,22761,'2008-01-13',8101.2001953125,'Peso '),
	 (1,22761,'2008-01-13',8101.2001953125,'Peso '),
	 (129,34009,'2008-03-17',9608.400390625,'Peso '),
	 (1,34009,'2008-03-17',9608.400390625,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (38,25843,'2011-12-07',3658510.5,'Peso '),
	 (75,28259,'2017-05-12',301289.09375,'Peso '),
	 (92,25300,'2018-11-25',602578.1875,'Peso '),
	 (11,25300,'2018-11-25',602578.1875,'Peso '),
	 (92,49167,'2018-12-06',6594.0,'Peso '),
	 (11,49167,'2018-12-06',6594.0,'Peso '),
	 (21,35020,'2021-04-19',539.4000244140625,'Dólar'),
	 (8,35020,'2021-04-19',539.4000244140625,'Dólar'),
	 (130,41924,'2017-11-25',483.6000061035156,'Dólar'),
	 (15,41924,'2017-11-25',483.6000061035156,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (72,16181,'2020-04-28',120.9000015258789,'Dólar'),
	 (113,20157,'2016-09-08',186.0,'Dólar'),
	 (54,20157,'2016-09-08',186.0,'Dólar'),
	 (113,34833,'2017-10-23',590.0,'Euro'),
	 (54,34833,'2017-10-23',590.0,'Euro'),
	 (99,44068,'2023-02-02',688.2000122070312,'Dólar'),
	 (65,44068,'2023-02-02',688.2000122070312,'Dólar'),
	 (109,18380,'2018-06-08',50.0,'Euro'),
	 (5,18380,'2018-06-08',50.0,'Euro'),
	 (109,38809,'2022-05-22',204.60000610351562,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (5,38809,'2022-05-22',204.60000610351562,'Dólar'),
	 (56,11209,'2022-10-04',210.0,'Euro'),
	 (71,24707,'2015-05-30',46.5,'Dólar'),
	 (114,14348,'2020-10-11',110.0,'Euro'),
	 (48,14348,'2020-10-11',110.0,'Euro'),
	 (114,36512,'2021-09-13',632.4000244140625,'Dólar'),
	 (48,36512,'2021-09-13',632.4000244140625,'Dólar'),
	 (77,13864,'2014-07-23',213.89999389648438,'Dólar'),
	 (108,19536,'2007-06-16',200.0,'Euro'),
	 (9,19536,'2007-06-16',200.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (108,39863,'2007-09-26',325.5,'Dólar'),
	 (9,39863,'2007-09-26',325.5,'Dólar'),
	 (108,56109,'2018-10-08',270.0,'Euro'),
	 (9,56109,'2018-10-08',270.0,'Euro'),
	 (81,17211,'2018-08-22',158.10000610351562,'Dólar'),
	 (122,31259,'2023-08-16',210.0,'Euro'),
	 (112,31259,'2023-08-16',210.0,'Euro'),
	 (106,49644,'2006-12-02',590.0,'Euro'),
	 (30,49644,'2006-12-02',590.0,'Euro'),
	 (28,17713,'2008-06-07',455.70001220703125,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (62,22765,'2020-02-03',50.0,'Euro'),
	 (93,16746,'2003-05-06',560.0,'Euro'),
	 (85,16746,'2003-05-06',560.0,'Euro'),
	 (89,11937,'2020-07-14',590.0,'Euro'),
	 (80,16314,'2010-08-06',446.3999938964844,'Dólar'),
	 (42,20272,'2009-06-01',850.0,'Euro'),
	 (79,27678,'2021-12-22',232.5,'Dólar'),
	 (14,25928,'2005-09-11',460.0,'Euro'),
	 (107,17322,'2018-05-24',720.0,'Euro'),
	 (52,14565,'2022-10-14',350.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (4,15306,'2015-12-29',840.0,'Euro'),
	 (84,29114,'2009-07-10',530.0,'Euro'),
	 (13,29114,'2009-07-10',530.0,'Euro'),
	 (84,66643,'2011-11-06',770.0,'Euro'),
	 (13,66643,'2011-11-06',770.0,'Euro'),
	 (96,20756,'2011-03-09',780.0,'Euro'),
	 (21,11715,'2016-05-13',430413.0,'Peso '),
	 (8,11715,'2016-05-13',430413.0,'Peso '),
	 (130,19822,'2017-01-24',1678610.75,'Peso '),
	 (15,19822,'2017-01-24',1678610.75,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (130,57202,'2021-05-04',387371.6875,'Peso '),
	 (15,57202,'2021-05-04',387371.6875,'Peso '),
	 (99,25879,'2019-05-13',4898.39990234375,'Peso '),
	 (65,25879,'2019-05-13',4898.39990234375,'Peso '),
	 (23,22300,'2022-08-28',3391.199951171875,'Peso '),
	 (125,25614,'2023-07-13',3055932.25,'Peso '),
	 (131,22988,'2017-11-12',16390.80078125,''),
	 (24,22988,'2017-11-12',16390.80078125,''),
	 (131,47336,'2019-06-20',946908.625,'Peso '),
	 (24,47336,'2019-06-20',946908.625,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (17,29407,'2022-08-18',4898.39990234375,'Peso '),
	 (69,14720,'2022-05-03',16956.0,'Peso '),
	 (114,52881,'2022-04-12',3873717.0,'Peso '),
	 (48,52881,'2022-04-12',3873717.0,'Peso '),
	 (20,14097,'1999-09-04',1162115.125,'Peso '),
	 (7,14097,'1999-09-04',1162115.125,'Peso '),
	 (20,28378,'2014-05-14',559536.875,'Peso '),
	 (7,28378,'2014-05-14',559536.875,'Peso '),
	 (122,12808,'2021-08-15',2637.60009765625,'Peso '),
	 (112,12808,'2021-08-15',2637.60009765625,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (106,26924,'2006-02-11',3012891.0,'Peso '),
	 (30,26924,'2006-02-11',3012891.0,'Peso '),
	 (106,62371,'2007-01-03',3701551.75,'Peso '),
	 (30,62371,'2007-01-03',3701551.75,'Peso '),
	 (106,90278,'2007-11-23',3572428.0,'Peso '),
	 (30,90278,'2007-11-23',3572428.0,'Peso '),
	 (60,19345,'2018-07-09',8854.7998046875,'Peso '),
	 (98,15082,'2003-10-06',9043.2001953125,'Peso '),
	 (93,37787,'2009-05-25',3830675.75,'Peso '),
	 (85,37787,'2009-05-25',3830675.75,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (10,11436,'2001-04-27',1936858.5,'Peso '),
	 (51,27367,'2022-05-06',16202.400390625,'Peso '),
	 (84,53723,'2009-08-21',3228097.5,'Peso '),
	 (13,53723,'2009-08-21',3228097.5,'Peso '),
	 (82,27720,'2007-01-18',7347.60009765625,'Peso '),
	 (49,17802,'2015-12-22',100.0,'Euro'),
	 (27,17802,'2015-12-22',100.0,'Euro'),
	 (49,39243,'2023-08-26',46.5,'Dólar'),
	 (27,39243,'2023-08-26',46.5,'Dólar'),
	 (57,15249,'2014-01-12',530.0999755859375,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (95,34682,'2009-04-14',279.0,'Dólar'),
	 (66,34682,'2009-04-14',279.0,'Dólar'),
	 (41,15837,'2021-11-16',830.0,'Euro'),
	 (45,22207,'2019-08-02',316.20001220703125,'Dólar'),
	 (76,37800,'2008-09-25',670.0,'Euro'),
	 (36,37800,'2008-09-25',670.0,'Euro'),
	 (78,16201,'2013-10-25',510.0,'Euro'),
	 (2,16201,'2013-10-25',510.0,'Euro'),
	 (6,22625,'2003-10-29',595.2000122070312,'Dólar'),
	 (104,45588,'2021-08-01',669.5999755859375,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (53,45588,'2021-08-01',669.5999755859375,'Dólar'),
	 (29,11276,'2016-07-17',620.0,'Euro'),
	 (103,25569,'2016-11-01',330.0,'Euro'),
	 (39,25009,'2020-05-08',620.0,'Euro'),
	 (123,20625,'2015-05-30',827.7000122070312,'Dólar'),
	 (32,20625,'2015-05-30',827.7000122070312,'Dólar'),
	 (123,46451,'2015-06-11',548.7000122070312,'Dólar'),
	 (32,46451,'2015-06-11',548.7000122070312,'Dólar'),
	 (123,62529,'2015-06-18',350.0,'Euro'),
	 (32,62529,'2015-06-18',350.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (123,90819,'2016-08-25',241.8000030517578,'Dólar'),
	 (32,90819,'2016-08-25',241.8000030517578,'Dólar'),
	 (127,22437,'2014-05-29',186.0,'Dólar'),
	 (126,29564,'2020-07-07',1076032.5,'Peso'),
	 (67,19543,'2017-12-13',344330.40625,'Peso '),
	 (92,76863,'2023-05-08',8478.0,'Peso '),
	 (11,76863,'2023-05-08',8478.0,'Peso '),
	 (91,22339,'2015-12-01',6594.0,'Peso '),
	 (94,15206,'2023-03-05',10173.599609375,'Peso '),
	 (31,17619,'2022-04-15',11869.2001953125,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (49,28533,'2015-12-27',516495.59375,'Peso '),
	 (27,28533,'2015-12-27',516495.59375,'Peso '),
	 (110,18724,'2013-09-10',2109023.75,'Peso '),
	 (70,15657,'2014-02-25',817784.6875,'Peso '),
	 (46,23034,'2021-02-22',817784.6875,'Peso '),
	 (95,19109,'1999-09-27',9985.2001953125,'Peso '),
	 (66,19109,'1999-09-27',9985.2001953125,'Peso '),
	 (111,20293,'2019-12-20',602578.1875,'Peso '),
	 (44,20293,'2019-12-20',602578.1875,'Peso '),
	 (111,33325,'2020-01-25',1979899.75,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (44,33325,'2020-01-25',1979899.75,'Peso '),
	 (111,43580,'2021-01-15',14318.400390625,'Peso '),
	 (44,43580,'2021-01-15',14318.400390625,'Peso '),
	 (26,13470,'2014-03-18',2668560.5,'Peso '),
	 (128,21369,'2016-08-16',2109023.75,'Peso '),
	 (76,23426,'2008-06-16',3572428.0,'Peso '),
	 (36,23426,'2008-06-16',3572428.0,'Peso '),
	 (76,60028,'2023-08-20',4898.39990234375,'Peso '),
	 (36,60028,'2023-08-20',4898.39990234375,'Peso '),
	 (78,39865,'2015-03-30',1162115.125,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (2,39865,'2015-03-30',1162115.125,'Peso '),
	 (104,18893,'2018-05-05',1695.5999755859375,'Peso '),
	 (53,18893,'2018-05-05',1695.5999755859375,'Peso '),
	 (22,27814,'2020-05-01',7536.0,'Peso '),
	 (34,16890,'2008-11-20',3228097.5,'Peso '),
	 (43,21660,'2010-04-07',2238147.5,'Peso '),
	 (88,19344,'2022-03-26',13753.2001953125,'Peso '),
	 (124,19885,'2021-12-06',559536.875,'Peso '),
	 (40,12028,'2010-05-13',734.7000122070312,'Dólar'),
	 (19,12028,'2010-05-13',734.7000122070312,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (40,28312,'2016-05-17',460.0,'Euro'),
	 (19,28312,'2016-05-17',460.0,'Euro'),
	 (101,41764,'2008-05-24',800.0,'Euro'),
	 (16,41764,'2008-05-24',800.0,'Euro'),
	 (116,50738,'2012-04-02',697.5,'Dólar'),
	 (105,50738,'2012-04-02',697.5,'Dólar'),
	 (86,11140,'2021-12-04',730.0,'Euro'),
	 (55,19245,'2014-05-16',570.0,'Euro'),
	 (87,16209,'2014-02-10',120.9000015258789,'Dólar'),
	 (74,16209,'2014-02-10',120.9000015258789,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (87,27845,'2014-04-27',80.0,'Euro'),
	 (74,27845,'2014-04-27',80.0,'Euro'),
	 (117,16879,'2015-09-27',437.1000061035156,'Dólar'),
	 (73,16879,'2015-09-27',437.1000061035156,'Dólar'),
	 (68,13755,'2021-04-04',632.4000244140625,'Dólar'),
	 (97,16226,'2018-09-24',90.0,'Euro'),
	 (132,14526,'2023-04-14',170.0,'Euro'),
	 (133,49405,'2011-05-04',83.69999694824219,'Dólar'),
	 (119,49405,'2011-05-04',83.69999694824219,'Dólar'),
	 (3,24407,'2019-02-23',325.5,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (47,40390,'2010-05-03',399.8999938964844,'Dólar'),
	 (12,40390,'2010-05-03',399.8999938964844,'Dólar'),
	 (118,21132,'2017-08-27',306.8999938964844,'Dólar'),
	 (61,42110,'2021-04-19',74.4000015258789,'Dólar'),
	 (50,42110,'2021-04-19',74.4000015258789,'Dólar'),
	 (59,25110,'2016-05-30',440.0,'Euro'),
	 (83,21421,'2020-12-29',390.6000061035156,'Dólar'),
	 (120,51615,'2003-07-26',590.0,'Euro'),
	 (63,51615,'2003-07-26',590.0,'Euro'),
	 (120,74997,'2004-04-27',83.69999694824219,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (63,74997,'2004-04-27',83.69999694824219,'Dólar'),
	 (120,90943,'2009-06-04',548.7000122070312,'Dólar'),
	 (63,90943,'2009-06-04',548.7000122070312,'Dólar'),
	 (90,25366,'2016-03-09',753.2999877929688,'Dólar'),
	 (115,17526,'2014-12-09',269.70001220703125,'Dólar'),
	 (58,17526,'2014-12-09',269.70001220703125,'Dólar'),
	 (115,40875,'2015-09-05',610.0,'Euro'),
	 (58,40875,'2015-09-05',610.0,'Euro'),
	 (115,59896,'2015-09-23',290.0,'Euro'),
	 (58,59896,'2015-09-23',290.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (115,72001,'2016-05-24',399.8999938964844,'Dólar'),
	 (58,72001,'2016-05-24',399.8999938964844,'Dólar'),
	 (129,60377,'2012-11-14',450.0,'Euro'),
	 (1,60377,'2012-11-14',450.0,'Euro'),
	 (35,22523,'2015-06-15',820.0,'Euro'),
	 (101,12066,'2000-05-18',1162115.125,'Peso '),
	 (16,12066,'2000-05-18',1162115.125,'Peso '),
	 (116,21955,'2012-01-19',3615469.25,'Peso '),
	 (105,21955,'2012-01-19',3615469.25,'Peso '),
	 (116,74499,'2012-06-28',11869.2001953125,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (105,74499,'2012-06-28',11869.2001953125,'Peso '),
	 (116,94670,'2013-06-24',3579.60009765625,'Peso '),
	 (105,94670,'2013-06-24',3579.60009765625,'Peso '),
	 (100,24441,'2019-09-04',14695.2001953125,'Peso '),
	 (18,20410,'2022-07-08',7912.7998046875,'Peso '),
	 (87,38072,'2014-06-07',1695.5999755859375,'Peso '),
	 (74,38072,'2014-06-07',1695.5999755859375,'Peso '),
	 (87,49153,'2021-11-30',16767.599609375,'Peso '),
	 (74,49153,'2021-11-30',16767.599609375,'Peso '),
	 (121,20263,'2017-11-02',15825.599609375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (117,34964,'2019-08-24',2883767.0,'Peso '),
	 (73,34964,'2019-08-24',2883767.0,'Peso '),
	 (25,23043,'2022-05-24',14883.599609375,'Peso '),
	 (33,17187,'2017-12-13',1884.0,'Peso '),
	 (133,21563,'2011-01-06',3228097.5,'Peso '),
	 (119,21563,'2011-01-06',3228097.5,'Peso '),
	 (133,69454,'2023-03-11',1507.199951171875,'Peso '),
	 (119,69454,'2023-03-11',1507.199951171875,'Peso '),
	 (102,18060,'2012-04-17',1463404.25,'Peso '),
	 (37,18060,'2012-04-17',1463404.25,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (102,37513,'2013-01-10',16767.599609375,'Peso '),
	 (37,37513,'2013-01-10',16767.599609375,'Peso '),
	 (102,58378,'2019-06-16',14883.599609375,'Peso '),
	 (37,58378,'2019-06-16',14883.599609375,'Peso '),
	 (64,14181,'2022-05-31',11492.400390625,'Peso '),
	 (47,18053,'2010-02-22',5086.7998046875,'Peso '),
	 (12,18053,'2010-02-22',5086.7998046875,'Peso '),
	 (47,63099,'2010-12-08',2324230.25,'Peso '),
	 (12,63099,'2010-12-08',2324230.25,'Peso '),
	 (61,13171,'2006-01-18',12622.7998046875,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (50,13171,'2006-01-18',12622.7998046875,'Peso '),
	 (61,29474,'2006-02-27',2926808.5,'Peso '),
	 (50,29474,'2006-02-27',2926808.5,'Peso '),
	 (120,24801,'2003-04-28',13941.599609375,'Peso '),
	 (63,24801,'2003-04-28',13941.599609375,'Peso '),
	 (129,22761,'2008-01-13',8101.2001953125,'Peso '),
	 (1,22761,'2008-01-13',8101.2001953125,'Peso '),
	 (129,34009,'2008-03-17',9608.400390625,'Peso '),
	 (1,34009,'2008-03-17',9608.400390625,'Peso '),
	 (38,25843,'2011-12-07',3658510.5,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (75,28259,'2017-05-12',301289.09375,'Peso '),
	 (92,25300,'2018-11-25',602578.1875,'Peso '),
	 (11,25300,'2018-11-25',602578.1875,'Peso '),
	 (92,49167,'2018-12-06',6594.0,'Peso '),
	 (11,49167,'2018-12-06',6594.0,'Peso '),
	 (21,35020,'2021-04-19',539.4000244140625,'Dólar'),
	 (8,35020,'2021-04-19',539.4000244140625,'Dólar'),
	 (130,41924,'2017-11-25',483.6000061035156,'Dólar'),
	 (15,41924,'2017-11-25',483.6000061035156,'Dólar'),
	 (72,16181,'2020-04-28',120.9000015258789,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (113,20157,'2016-09-08',186.0,'Dólar'),
	 (54,20157,'2016-09-08',186.0,'Dólar'),
	 (113,34833,'2017-10-23',590.0,'Euro'),
	 (54,34833,'2017-10-23',590.0,'Euro'),
	 (99,44068,'2023-02-02',688.2000122070312,'Dólar'),
	 (65,44068,'2023-02-02',688.2000122070312,'Dólar'),
	 (109,18380,'2018-06-08',50.0,'Euro'),
	 (5,18380,'2018-06-08',50.0,'Euro'),
	 (109,38809,'2022-05-22',204.60000610351562,'Dólar'),
	 (5,38809,'2022-05-22',204.60000610351562,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (56,11209,'2022-10-04',210.0,'Euro'),
	 (71,24707,'2015-05-30',46.5,'Dólar'),
	 (114,14348,'2020-10-11',110.0,'Euro'),
	 (48,14348,'2020-10-11',110.0,'Euro'),
	 (114,36512,'2021-09-13',632.4000244140625,'Dólar'),
	 (48,36512,'2021-09-13',632.4000244140625,'Dólar'),
	 (77,13864,'2014-07-23',213.89999389648438,'Dólar'),
	 (108,19536,'2007-06-16',200.0,'Euro'),
	 (9,19536,'2007-06-16',200.0,'Euro'),
	 (108,39863,'2007-09-26',325.5,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (9,39863,'2007-09-26',325.5,'Dólar'),
	 (108,56109,'2018-10-08',270.0,'Euro'),
	 (9,56109,'2018-10-08',270.0,'Euro'),
	 (81,17211,'2018-08-22',158.10000610351562,'Dólar'),
	 (122,31259,'2023-08-16',210.0,'Euro'),
	 (112,31259,'2023-08-16',210.0,'Euro'),
	 (106,49644,'2006-12-02',590.0,'Euro'),
	 (30,49644,'2006-12-02',590.0,'Euro'),
	 (28,17713,'2008-06-07',455.70001220703125,'Dólar'),
	 (62,22765,'2020-02-03',50.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (93,16746,'2003-05-06',560.0,'Euro'),
	 (85,16746,'2003-05-06',560.0,'Euro'),
	 (89,11937,'2020-07-14',590.0,'Euro'),
	 (80,16314,'2010-08-06',446.3999938964844,'Dólar'),
	 (42,20272,'2009-06-01',850.0,'Euro'),
	 (79,27678,'2021-12-22',232.5,'Dólar'),
	 (14,25928,'2005-09-11',460.0,'Euro'),
	 (107,17322,'2018-05-24',720.0,'Euro'),
	 (52,14565,'2022-10-14',350.0,'Euro'),
	 (4,15306,'2015-12-29',840.0,'Euro');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (84,29114,'2009-07-10',530.0,'Euro'),
	 (13,29114,'2009-07-10',530.0,'Euro'),
	 (84,66643,'2011-11-06',770.0,'Euro'),
	 (13,66643,'2011-11-06',770.0,'Euro'),
	 (96,20756,'2011-03-09',780.0,'Euro'),
	 (21,11715,'2016-05-13',430413.0,'Peso '),
	 (8,11715,'2016-05-13',430413.0,'Peso '),
	 (130,19822,'2017-01-24',1678610.75,'Peso '),
	 (15,19822,'2017-01-24',1678610.75,'Peso '),
	 (130,57202,'2021-05-04',387371.6875,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (15,57202,'2021-05-04',387371.6875,'Peso '),
	 (99,25879,'2019-05-13',4898.39990234375,'Peso '),
	 (65,25879,'2019-05-13',4898.39990234375,'Peso '),
	 (23,22300,'2022-08-28',3391.199951171875,'Peso '),
	 (125,25614,'2023-07-13',3055932.25,'Peso '),
	 (131,22988,'2017-11-12',16390.80078125,''),
	 (24,22988,'2017-11-12',16390.80078125,''),
	 (131,47336,'2019-06-20',946908.625,'Peso '),
	 (24,47336,'2019-06-20',946908.625,'Peso '),
	 (17,29407,'2022-08-18',4898.39990234375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (69,14720,'2022-05-03',16956.0,'Peso '),
	 (114,52881,'2022-04-12',3873717.0,'Peso '),
	 (48,52881,'2022-04-12',3873717.0,'Peso '),
	 (20,14097,'1999-09-04',1162115.125,'Peso '),
	 (7,14097,'1999-09-04',1162115.125,'Peso '),
	 (20,28378,'2014-05-14',559536.875,'Peso '),
	 (7,28378,'2014-05-14',559536.875,'Peso '),
	 (122,12808,'2021-08-15',2637.60009765625,'Peso '),
	 (112,12808,'2021-08-15',2637.60009765625,'Peso '),
	 (106,26924,'2006-02-11',3012891.0,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (30,26924,'2006-02-11',3012891.0,'Peso '),
	 (106,62371,'2007-01-03',3701551.75,'Peso '),
	 (30,62371,'2007-01-03',3701551.75,'Peso '),
	 (106,90278,'2007-11-23',3572428.0,'Peso '),
	 (30,90278,'2007-11-23',3572428.0,'Peso '),
	 (60,19345,'2018-07-09',8854.7998046875,'Peso '),
	 (98,15082,'2003-10-06',9043.2001953125,'Peso '),
	 (93,37787,'2009-05-25',3830675.75,'Peso '),
	 (85,37787,'2009-05-25',3830675.75,'Peso '),
	 (10,11436,'2001-04-27',1936858.5,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (51,27367,'2022-05-06',16202.400390625,'Peso '),
	 (84,53723,'2009-08-21',3228097.5,'Peso '),
	 (13,53723,'2009-08-21',3228097.5,'Peso '),
	 (82,27720,'2007-01-18',7347.60009765625,'Peso '),
	 (49,17802,'2015-12-22',100.0,'Euro'),
	 (27,17802,'2015-12-22',100.0,'Euro'),
	 (49,39243,'2023-08-26',46.5,'Dólar'),
	 (27,39243,'2023-08-26',46.5,'Dólar'),
	 (57,15249,'2014-01-12',530.0999755859375,'Dólar'),
	 (95,34682,'2009-04-14',279.0,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (66,34682,'2009-04-14',279.0,'Dólar'),
	 (41,15837,'2021-11-16',830.0,'Euro'),
	 (45,22207,'2019-08-02',316.20001220703125,'Dólar'),
	 (76,37800,'2008-09-25',670.0,'Euro'),
	 (36,37800,'2008-09-25',670.0,'Euro'),
	 (78,16201,'2013-10-25',510.0,'Euro'),
	 (2,16201,'2013-10-25',510.0,'Euro'),
	 (6,22625,'2003-10-29',595.2000122070312,'Dólar'),
	 (104,45588,'2021-08-01',669.5999755859375,'Dólar'),
	 (53,45588,'2021-08-01',669.5999755859375,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (29,11276,'2016-07-17',620.0,'Euro'),
	 (103,25569,'2016-11-01',330.0,'Euro'),
	 (39,25009,'2020-05-08',620.0,'Euro'),
	 (123,20625,'2015-05-30',827.7000122070312,'Dólar'),
	 (32,20625,'2015-05-30',827.7000122070312,'Dólar'),
	 (123,46451,'2015-06-11',548.7000122070312,'Dólar'),
	 (32,46451,'2015-06-11',548.7000122070312,'Dólar'),
	 (123,62529,'2015-06-18',350.0,'Euro'),
	 (32,62529,'2015-06-18',350.0,'Euro'),
	 (123,90819,'2016-08-25',241.8000030517578,'Dólar');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (32,90819,'2016-08-25',241.8000030517578,'Dólar'),
	 (127,22437,'2014-05-29',186.0,'Dólar'),
	 (126,29564,'2020-07-07',1076032.5,'Peso'),
	 (67,19543,'2017-12-13',344330.40625,'Peso '),
	 (92,76863,'2023-05-08',8478.0,'Peso '),
	 (11,76863,'2023-05-08',8478.0,'Peso '),
	 (91,22339,'2015-12-01',6594.0,'Peso '),
	 (94,15206,'2023-03-05',10173.599609375,'Peso '),
	 (31,17619,'2022-04-15',11869.2001953125,'Peso '),
	 (49,28533,'2015-12-27',516495.59375,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (27,28533,'2015-12-27',516495.59375,'Peso '),
	 (110,18724,'2013-09-10',2109023.75,'Peso '),
	 (70,15657,'2014-02-25',817784.6875,'Peso '),
	 (46,23034,'2021-02-22',817784.6875,'Peso '),
	 (95,19109,'1999-09-27',9985.2001953125,'Peso '),
	 (66,19109,'1999-09-27',9985.2001953125,'Peso '),
	 (111,20293,'2019-12-20',602578.1875,'Peso '),
	 (44,20293,'2019-12-20',602578.1875,'Peso '),
	 (111,33325,'2020-01-25',1979899.75,'Peso '),
	 (44,33325,'2020-01-25',1979899.75,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (111,43580,'2021-01-15',14318.400390625,'Peso '),
	 (44,43580,'2021-01-15',14318.400390625,'Peso '),
	 (26,13470,'2014-03-18',2668560.5,'Peso '),
	 (128,21369,'2016-08-16',2109023.75,'Peso '),
	 (76,23426,'2008-06-16',3572428.0,'Peso '),
	 (36,23426,'2008-06-16',3572428.0,'Peso '),
	 (76,60028,'2023-08-20',4898.39990234375,'Peso '),
	 (36,60028,'2023-08-20',4898.39990234375,'Peso '),
	 (78,39865,'2015-03-30',1162115.125,'Peso '),
	 (2,39865,'2015-03-30',1162115.125,'Peso ');
INSERT INTO flota_keepcoding.revision (id_coche,kilometros_revision,fecha_revision,importe,moneda) VALUES
	 (104,18893,'2018-05-05',1695.5999755859375,'Peso '),
	 (53,18893,'2018-05-05',1695.5999755859375,'Peso '),
	 (22,27814,'2020-05-01',7536.0,'Peso '),
	 (34,16890,'2008-11-20',3228097.5,'Peso '),
	 (43,21660,'2010-04-07',2238147.5,'Peso '),
	 (88,19344,'2022-03-26',13753.2001953125,'Peso '),
	 (124,19885,'2021-12-06',559536.875,'Peso ');

	select c.modelo, m.nombre_marca,g.nombre_grupo,c.fecha_compra, c.matricula, c.color,c.kilometros, a.nombre_aseguradora,c.numero_poliza  from flota_keepcoding.coche c INNER join flota_keepcoding.marca m on c.id_marca =m.id_marca inner join flota_keepcoding.grupo g on g.id_grupo = m.id_grupo inner  join  flota_keepcoding.aseguradora a on c.id_aseguradora =a.id_aseguradora  